particle-iot/device-os/hal/src/nRF52840/usart_hal.cpp
    int end() {
        CHECK_TRUE(state_ != HAL_USART_STATE_DISABLED, SYSTEM_ERROR_INVALID_STATE);
        AtomicSection lk;

        CHECK(disable());

        state_ = HAL_USART_STATE_DISABLED;
        transmitting_ = false;
        receiving_ = 0;
        config_ = {};
        rxBuffer_.reset();
        txBuffer_.reset();

        return SYSTEM_ERROR_NONE;
    }

    int suspend() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        
        flush();

        AtomicSection lk;

        // Update current available received data
        size_t consumable = 0;
        {
            RxLock lk(uarte_);
            CHECK(data(&consumable));
            if (consumable > 0) {
                rxBuffer_.acquireCommit(consumable);
            }
        }
        CHECK(disable(false));

        state_ = HAL_USART_STATE_SUSPENDED;
        transmitting_ = false;
        receiving_ = 0;
        rxBuffer_.prune();
        txBuffer_.reset();

        return SYSTEM_ERROR_NONE;
    }

    int restore() {
        AtomicSection lk;
        CHECK_TRUE(state_ == HAL_USART_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        return begin(config_);
    }

    ssize_t data(size_t* consumable = nullptr) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);

        size_t d = CHECK(rxBuffer_.data());

        // At the very least we already have `d` commited bytes in rx buffer

        if (receiving_) {
            // IMPORTANT: It seems that the timer value (which is a counter for every time UARTE generates RXDRDY event)
            // may potentially get larger than the configured RX DMA transfer:
            // <quote>
            // For each byte received over the RXD line, an RXDRDY event will be generated.
            // This event is likely to occur before the corresponding data has been transferred to Data RAM.
            // </quote>
            // We'll be extra careful here and make sure not to consume more than we can, otherwise
            // we may put the ring buffer into an invalid state as there are not safety checks.
            uint16_t lastTimer = lastTimerValue_;
            uint16_t rxConsumed = rxConsumed_;
            if (rxConsumed == 0) {
                // Re-read lastTimerValue_ to sync up
                lastTimer = lastTimerValue_;
                // Update d, as we might have received ENDRX in-between previous `d` calculation and now
                d = CHECK(rxBuffer_.data());
                if (!receiving_) {
                    return d;
                }
            }
            uint16_t timerVal = timerValue() - lastTimer; // https://en.cppreference.com/w/c/language/conversion 
            const size_t canConsume = std::min<uint16_t>(timerVal - rxConsumed, rxBuffer_.acquirePending());
            d += canConsume;
            if (consumable) {
                *consumable = canConsume;
            }
        }
        return d;
    }

    ssize_t space() {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        TxLock lk(uarte_);
        return txBuffer_.space();
    }

    ssize_t read(uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        size_t consumable = 0;
        const ssize_t maxRead = CHECK(data(&consumable));
        const size_t readSize = std::min((size_t)maxRead, size);
        CHECK_TRUE(readSize > 0, SYSTEM_ERROR_NO_MEMORY);
        RxLock lk(uarte_);
        if (consumable > 0) {
            CHECK(data(&consumable));
            if (consumable > 0) {
                rxBuffer_.acquireCommit(consumable);
                rxConsumed_ += consumable;
            }
        }
        ssize_t r = CHECK(rxBuffer_.get(buffer, readSize));
        if (!receiving_) {
            startReceiver();
        }
        return r;
    }

    ssize_t peek(uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t maxRead = CHECK(data());
        const size_t peekSize = std::min((size_t)maxRead, size);
        CHECK_TRUE(peekSize > 0, SYSTEM_ERROR_NO_MEMORY);
        RxLock lk(uarte_);
        return rxBuffer_.peek(buffer, peekSize);
    }

    ssize_t write(const uint8_t* buffer, size_t size) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);
        const ssize_t canWrite = CHECK(space());
        const size_t writeSize = std::min((size_t)canWrite, size);
        CHECK_TRUE(writeSize > 0, SYSTEM_ERROR_NO_MEMORY);
        ssize_t r;
        {
            TxLock lk(uarte_);
            r = CHECK(txBuffer_.put(buffer, writeSize));
        }
        // Start transmission
        startTransmission();
        return r;
    }

    ssize_t flush() {
        while (true) {
            while (transmitting_) {
                // FIXME: busy loop
            }
            {
                TxLock lk(uarte_);
                if (!isEnabled() || txBuffer_.empty()) {
                    break;
                }
            }
        }
        return 0;
    }

    bool isConfigured() const {
        return configured_;
    }

    bool isEnabled() const {
        return state_ == HAL_USART_STATE_ENABLED;
    }

    void pump() {
        if (!willPreempt() && isEnabled()) {
            interruptHandler();
        }
    }

    void interruptHandler() {
        BaseType_t yield = pdFALSE;
        bool eventGenerated = false;

        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_RXDRDY_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_RXDRDY)) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_RXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_RXDRDY);
                if (xEventGroupSetBitsFromISR(evGroup_, HAL_USART_PVT_EVENT_READABLE, &yield) != pdFAIL) {
                    eventGenerated = true;
                }
            }
        }

        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_TXDRDY_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_TXDRDY)) {
                nrf_uarte_int_disable(uarte_, NRF_UARTE_INT_TXDRDY_MASK);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXDRDY);
                BaseType_t yieldTx = pdFALSE;
                if (xEventGroupSetBitsFromISR(evGroup_, HAL_USART_PVT_EVENT_WRITABLE, &yieldTx) != pdFAIL) {
                    eventGenerated = true;
                }
                yield = yield || yieldTx;
            }
        }

        // IMPORTANT: we cannot process ENDRX event if we are under the RX lock (ENDRX interrupt is disabled)
        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_ENDRX_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_ENDRX)) {
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ENDRX);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_RXDRDY);

                lastTimerValue_ += (rxConsumed_ + (uint16_t)(rxBuffer_.acquirePending()));
                rxConsumed_ = 0;

                if (rxBuffer_.acquirePending() > 0) {
                    rxBuffer_.acquireCommit(rxBuffer_.acquirePending());
                }

                --receiving_;
                startReceiver();
            }
        }

        // IMPORTANT: we cannot process ENDTX event if we are under the TX lock (ENDTX interrupt is disabled)
        if (nrf_uarte_int_enable_check(uarte_, NRF_UARTE_INT_ENDTX_MASK)) {
            if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_ENDTX)) {
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ENDTX);
                nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_TXDRDY);
                txBuffer_.consumeCommit(nrf_uarte_tx_amount_get(uarte_));
                transmitting_ = false;
                startTransmission();
            }
        }
        if (nrf_uarte_event_check(uarte_, NRF_UARTE_EVENT_ERROR)) {
            nrf_uarte_event_clear(uarte_, NRF_UARTE_EVENT_ERROR);
            uint32_t uartErrorSource = nrf_uarte_errorsrc_get_and_clear(uarte_);
            (void)uartErrorSource;
        }

